export default {
  /**
   * 获取手机区号列表
   */
  getRoleList: {
    url: '/base/country/mobilePhoneCode/list',
    method: 'get',
    data: [
      {
        area: '中国大陆',
        code: '+86',
      },
      {
        area: '中国香港',
        code: '+852',
      },
      {
        area: '中国澳门',
        code: '+853',
      },
      {
        area: '中国台湾',
        code: '+886',
      },
      {
        area: '新加坡',
        code: '+65',
      },
      {
        area: '阿富汗',
        code: '+93',
      },
      {
        area: '阿尔巴尼亚',
        code: '+355',
      },
      {
        area: '阿尔格拉',
        code: '+213',
      },
      {
        area: '安道尔',
        code: '+376',
      },
      {
        area: '安哥拉',
        code: '+244',
      },
      {
        area: '安圭拉',
        code: '+1264',
      },
      {
        area: '阿森松岛',
        code: '+247',
      },
      {
        area: '安提瓜和巴布达',
        code: '+1268',
      },
      {
        area: '阿根廷',
        code: '+54',
      },
      {
        area: '亚美尼亚',
        code: '+374',
      },
      {
        area: '阿鲁巴',
        code: '+297',
      },
      {
        area: '澳大利亚',
        code: '+61',
      },
      {
        area: '奥地利',
        code: '+43',
      },
      {
        area: '阿塞拜疆',
        code: '+994',
      },
      {
        area: '巴哈马',
        code: '+1242',
      },
      {
        area: '巴林',
        code: '+973',
      },
      {
        area: '孟加拉国',
        code: '+880',
      },
      {
        area: '巴巴多斯',
        code: '+1246',
      },
      {
        area: '白俄罗斯',
        code: '+375',
      },
      {
        area: '比利时',
        code: '+32',
      },
      {
        area: '伯利兹',
        code: '+501',
      },
      {
        area: '贝宁',
        code: '+229',
      },
      {
        area: '百慕大',
        code: '+1441',
      },
      {
        area: '不丹',
        code: '+975',
      },
      {
        area: '玻利维亚',
        code: '+591',
      },
      {
        area: '波斯尼亚和黑塞哥维那',
        code: '+387',
      },
      {
        area: '博茨瓦纳',
        code: '+267',
      },
      {
        area: '巴西',
        code: '+55',
      },
      {
        area: '文莱',
        code: '+673',
      },
      {
        area: '保加利亚',
        code: '+359',
      },
      {
        area: '布基纳法索',
        code: '+226',
      },
      {
        area: '布隆迪',
        code: '+257',
      },
      {
        area: '柬埔寨',
        code: '+855',
      },
      {
        area: '喀麦隆',
        code: '+237',
      },
      {
        area: '加拿大',
        code: '+1',
      },
      {
        area: '佛得角',
        code: '+238',
      },
      {
        area: '开曼群岛',
        code: '+1345',
      },
      {
        area: '中非共和国',
        code: '+236',
      },
      {
        area: '乍得',
        code: '+235',
      },
      {
        area: '智利',
        code: '+56',
      },
      {
        area: '哥伦比亚',
        code: '+57',
      },
      {
        area: '科摩罗',
        code: '+269',
      },
      {
        area: '刚果共和国',
        code: '+242',
      },
      {
        area: '刚果民主共和国',
        code: '+243',
      },
      {
        area: '库克群岛',
        code: '+682',
      },
      {
        area: '哥斯达黎加',
        code: '+506',
      },
      {
        area: '科特迪沃',
        code: '+225',
      },
      {
        area: '克罗地亚',
        code: '+385',
      },
      {
        area: '古巴',
        code: '+53',
      },
      {
        area: '塞浦路斯',
        code: '+357',
      },
      {
        area: '+捷克共和国',
        code: '+420',
      },
      {
        area: '丹麦',
        code: '+45',
      },
      {
        area: '吉布提',
        code: '+253',
      },
      {
        area: '多米尼加',
        code: '+1767',
      },
      {
        area: '多米尼加共和国',
        code: '+1809',
      },
      {
        area: '厄瓜多尔',
        code: '+593',
      },
      {
        area: '埃及',
        code: '+20',
      },
      {
        area: '艾萨尔瓦多',
        code: '+503',
      },
      {
        area: '爱沙尼亚',
        code: '+372',
      },
      {
        area: '埃塞俄比亚',
        code: '+251',
      },
      {
        area: '法罗群岛',
        code: '+298',
      },
      {
        area: '斐济',
        code: '+679',
      },
      {
        area: '芬兰',
        code: '+358',
      },
      {
        area: '法国',
        code: '+33',
      },
      {
        area: '法属圭亚那',
        code: '+594',
      },
      {
        area: '法属波利尼西亚',
        code: '+689',
      },
      {
        area: '加蓬',
        code: '+241',
      },
      {
        area: '冈比亚',
        code: '+220',
      },
      {
        area: '格鲁吉亚',
        code: '+995',
      },
      {
        area: '德国',
        code: '+94',
      },
      {
        area: '加纳',
        code: '+233',
      },
      {
        area: '直布罗陀',
        code: '+350',
      },
      {
        area: '希腊',
        code: '+30',
      },
      {
        area: '格陵兰',
        code: '+299',
      },
      {
        area: '格林纳达',
        code: '+1473',
      },
      {
        area: '瓜德罗普',
        code: '+590',
      },
      {
        area: '关岛',
        code: '+1671',
      },
      {
        area: '危地马拉',
        code: '+502',
      },
      {
        area: '几内亚',
        code: '+240',
      },
      {
        area: '根西',
        code: '+44',
      },
      {
        area: '几内亚',
        code: '+224',
      },
      {
        area: '圭亚那',
        code: '+592',
      },
      {
        area: '海地',
        code: '+509',
      },
      {
        area: '洪都拉斯',
        code: '+504',
      },
      {
        area: '缅甸',
        code: '+95',
      },
      {
        area: '匈牙利',
        code: '+36',
      },
      {
        area: '冰岛',
        code: '+354',
      },
      {
        area: '印度',
        code: '+91',
      },
      {
        area: '印度尼西亚',
        code: '+62',
      },
      {
        area: '伊朗',
        code: '+98',
      },
      {
        area: '伊拉克',
        code: '+964',
      },
      {
        area: '爱尔兰',
        code: '+353',
      },
      {
        area: '马恩岛',
        code: '+44',
      },
      {
        area: '以色列',
        code: '+972',
      },
      {
        area: '意大利',
        code: '+93',
      },
      {
        area: '牙买加',
        code: '+1876',
      },
      {
        area: '日本',
        code: '+81',
      },
      {
        area: '泽西岛',
        code: '+44',
      },
      {
        area: '约旦',
        code: '+962',
      },
      {
        area: '哈萨克斯坦',
        code: '+7',
      },
      {
        area: '肯尼亚',
        code: '+254',
      },
      {
        area: '科索沃',
        code: '+383',
      },
      {
        area: '科威特',
        code: '+965',
      },
      {
        area: '吉尔吉斯斯坦',
        code: '+996',
      },
      {
        area: '老挝',
        code: '+856',
      },
      {
        area: '拉脱维亚',
        code: '+371',
      },
      {
        area: '黎巴嫩',
        code: '+961',
      },
      {
        area: '莱索托',
        code: '+266',
      },
      {
        area: '利比里亚',
        code: '+231',
      },
      {
        area: '利比亚',
        code: '+218',
      },
      {
        area: '列支敦士登',
        code: '+423',
      },
      {
        area: '立陶宛',
        code: '+370',
      },
      {
        area: '卢森堡',
        code: '+352',
      },
      {
        area: '马其顿',
        code: '+389',
      },
      {
        area: '马达加斯加',
        code: '+261',
      },
      {
        area: '马拉维',
        code: '+265',
      },
      {
        area: '马来西亚',
        code: '+60',
      },
      {
        area: '马尔代夫',
        code: '+960',
      },
      {
        area: '马里',
        code: '+223',
      },
      {
        area: '马耳他',
        code: '+356',
      },
      {
        area: '马提尼克',
        code: '+596',
      },
      {
        area: '毛里塔尼亚',
        code: '+222',
      },
      {
        area: '毛里求斯',
        code: '+230',
      },
      {
        area: '马约特',
        code: '+262',
      },
      {
        area: '墨西哥',
        code: '+52',
      },
      {
        area: '摩尔多瓦',
        code: '+373',
      },
      {
        area: '摩纳哥',
        code: '+377',
      },
      {
        area: '蒙古',
        code: '+976',
      },
      {
        area: '黑山',
        code: '+382',
      },
      {
        area: '蒙特塞拉特',
        code: '+1664',
      },
      {
        area: '摩洛哥',
        code: '+212',
      },
      {
        area: '莫桑比克',
        code: '+258',
      },
      {
        area: '纳米比亚',
        code: '+264',
      },
      {
        area: '尼泊尔',
        code: '+977',
      },
      {
        area: '荷兰',
        code: '+31',
      },
      {
        area: '荷属安的列斯',
        code: '+599',
      },
      {
        area: '新喀里多尼亚',
        code: '+687',
      },
      {
        area: '新西兰',
        code: '+64',
      },
      {
        area: '尼加拉瓜',
        code: '+505',
      },
      {
        area: '尼日尔',
        code: '+227',
      },
      {
        area: '尼日利亚',
        code: '+234',
      },
      {
        area: '挪威',
        code: '+47',
      },
      {
        area: '阿曼',
        code: '+968',
      },
      {
        area: '巴基斯坦',
        code: '+92',
      },
      {
        area: '巴勒斯坦',
        code: '+970',
      },
      {
        area: '巴拿马',
        code: '+507',
      },
      {
        area: '巴布亚新几内亚',
        code: '+675',
      },
      {
        area: '巴拉圭',
        code: '+595',
      },
      {
        area: '秘鲁',
        code: '+51',
      },
      {
        area: '菲律宾',
        code: '+63',
      },
      {
        area: '波兰',
        code: '+48',
      },
      {
        area: '葡萄牙',
        code: '+351',
      },
      {
        area: '波多黎各',
        code: '+1',
      },
      {
        area: '库塔',
        code: '+974',
      },
      {
        area: '留尼汪',
        code: '+262',
      },
      {
        area: '罗马尼亚',
        code: '+40',
      },
      {
        area: '俄罗斯',
        code: '+7',
      },
      {
        area: '卢旺达',
        code: '+250',
      },
      {
        area: '萨摩亚东部',
        code: '+684',
      },
      {
        area: '萨摩亚西部',
        code: '+685',
      },
      {
        area: '圣马力诺',
        code: '+378',
      },
      {
        area: '圣多美和普林西比',
        code: '+239',
      },
      {
        area: '沙特阿拉伯',
        code: '+966',
      },
      {
        area: '塞内加尔',
        code: '+221',
      },
      {
        area: '塞尔维亚',
        code: '+381',
      },
      {
        area: '塞舌尔',
        code: '+248',
      },
      {
        area: '塞拉利昂',
        code: '+232',
      },
      {
        area: '斯洛伐克',
        code: '+421',
      },
      {
        area: '斯洛文尼亚',
        code: '+386',
      },
      {
        area: '南非',
        code: '+27',
      },
      {
        area: '韩国',
        code: '+82',
      },
      {
        area: '西班牙',
        code: '+34',
      },
      {
        area: '斯里兰卡',
        code: '+94',
      },
      {
        area: '圣基茨和尼维斯',
        code: '+1869',
      },
      {
        area: '圣卢西亚',
        code: '+1758',
      },
      {
        area: '圣文森特',
        code: '+1784',
      },
      {
        area: '苏丹',
        code: '+249',
      },
      {
        area: '苏里南',
        code: '+597',
      },
      {
        area: '斯威士兰',
        code: '+268',
      },
      {
        area: '瑞典',
        code: '+46',
      },
      {
        area: '瑞士',
        code: '+41',
      },
      {
        area: '叙利亚',
        code: '+963',
      },
      {
        area: '塔吉克斯坦',
        code: '+992',
      },
      {
        area: '坦桑尼亚',
        code: '+255',
      },
      {
        area: '泰国',
        code: '+66',
      },
      {
        area: '东帝汶',
        code: '+670',
      },
      {
        area: '多哥',
        code: '+228',
      },
      {
        area: '汤加',
        code: '+676',
      },
      {
        area: '特立尼达和多巴哥',
        code: '+1868',
      },
      {
        area: '突尼斯',
        code: '+216',
      },
      {
        area: '土耳其',
        code: '+90',
      },
      {
        area: '土库曼斯坦',
        code: '+993',
      },
      {
        area: '特克斯和凯科斯群岛',
        code: '+1649',
      },
      {
        area: '乌干达',
        code: '+256',
      },
      {
        area: '乌克兰',
        code: '+380',
      },
      {
        area: '阿拉伯联合酋长国',
        code: '+971',
      },
      {
        area: '英国',
        code: '+44',
      },
      {
        area: '美国',
        code: '+1',
      },
      {
        area: '乌拉圭',
        code: '+598',
      },
      {
        area: '乌兹别克斯坦',
        code: '+998',
      },
      {
        area: '瓦努阿图',
        code: '+678',
      },
      {
        area: '委内瑞拉',
        code: '+58',
      },
      {
        area: '越南',
        code: '+84',
      },
      {
        area: '维尔京群岛',
        code: '+1340',
      },
      {
        area: '也门',
        code: '+967',
      },
      {
        area: '赞比亚',
        code: '+260',
      },
      {
        area: '津巴布韦',
        code: '+263',
      },
    ],
  },
  /**
   * 获取服务协议内容
   */
  getTermsConditionsData: {
    url: '/base/TermsConditions/info',
    method: 'get',
    data: '<h3><span style="">一、条款的范围与确认</span></h3><ol><li style="line-height: 2;">本条款有助于您了解本平台的服务内容及用户的使用权利、义务，请您仔细阅读本条款（<span style="">特别是以粗体标注的内容</span>）。在接受本条款之前，请您仔细阅读全部内容，如您无法准确理解或不同意本条款的任一内容，请不要进行后续操作。</li><li style="line-height: 2;"><span style="">通过网络页面点击确认、实际购买、使用我们提供的服务等操作，或以其他方式选择接受本条款的，即表示您同意并接受本条款的全部内容。</span></li><li style="line-height: 2;">由于互联网行业的高速发展，<span style="">本条款列明的条款未必能完整罗列并覆盖您与本平台的所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。</span>因此，本平台有权在后续运营中对本条款做任何修改和补充，并将在修改补充后再次将其公示以便获得您的确认。对于服务条款、隐私政策或规则的修改将在公布时或规定的生效日立即生效。</li><li style="line-height: 2;"><span style="">若在新的条款生效后访问和使用本平台产品服务，视为您同意接受修订后的服务条款。若您不同意变更修改后的条款内容，您有权停止使用相关服务、删除您有关账户信息中的内容等方式来终止服务条款。</span></li><li style="line-height: 2;"><span style="">如果您代表某个机构而非您个人注册、登录及使用本平台产品服务，则您将被认为已获得充分授权代表该机构同意本条款以及本条款后续的修改和补充。</span></li></ol><h3><span style="">二、账号注册与安全</span></h3><ol style="text-align: start;"><li style="line-height: 2;">您在使用本平台产品服务前需要注册本平台帐号。您须对注册信息的真实性、合法性、有效性承担全部责任，并配合我们依法核验您的注册信息；您不得未经授权代表他人或冒充他人；您也不得利用他人的名义发布任何信息或恶意使用注册帐号导致其他用户误认。</li><li style="line-height: 2;">您有责任妥善保管注册帐号及密码信息的安全，您需要对注册帐号项下的行为承担法律责任。<span style="">因您的原因造成的账户、密码等信息被冒用、盗用或非法使用，由此引起的一切风险、责任、损失、费用等应由您自行承担。</span></li><li style="line-height: 2;">您在注册帐号中设置的用户名、头像、个人介绍等必须遵守法律法规、公序良俗、社会公德，且不会侵害其他第三方的合法权益，否则我们可能会取消您的用户名、头像、个人介绍。</li><li style="line-height: 2;">如您发现有他人冒用或盗用您的帐号，请您立即以有效方式通知我们，您也可以向我们申请暂停或终止本平台产品服务。</li></ol><h3><span style="">三、用户使用相关规则</span></h3><ol><li style="line-height: 2;">您应遵守中华人民共和国相关法律法规及您所属、所居住的国家或地区的法律法规，不得将本平台产品或服务用于任何非法目的，也不得以任何非法方式使用本平台产品或服务，如有违反，其所有造成的法律责任、结果损失和相关赔偿均由用户本人自行承担。</li><li style="line-height: 2;">您承诺不得使用本平台服务、从事以下行为，包括但不限于：</li></ol><ul><li style="line-height: 2;">发布、传送、传播、储存违反国家法律、危害国家安全统一、社会稳定、公序良俗、社会公德以及侮辱、诽谤、淫秽、暴力的内容；</li><li style="line-height: 2;">发布、传送、传播、储存侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的内容；</li><li style="line-height: 2;">虚构事实、隐瞒真相以误导、欺骗他人；</li><li style="line-height: 2;">发表、传送、传播广告信息及垃圾信息；</li><li style="line-height: 2;">其他违反法律法规、政策及公序良俗或侵犯第三方合法权益的行为。</li></ul><p style="line-height: 2;">3. 您承诺发送或传播的内容应有合法来源，相关内容为您所有或您已获得权利人的授权。</p><p style="line-height: 2;">4. 您不得使用未经授权的插件、外挂或第三方工具对本条款项下的服务进行干扰、破坏、修改或施加其他影响。</p><p style="line-height: 2;">5. 您不得对本平台产品系统和程序采取反向工程手段进行破解，不得对上述系统和程序（包括但不限于源程序、目标程序、技术文档、服务器数据）进行复制、修改、编译、整合或篡改，不得修改或增减本平台产品系统的任何功能，如有违反，本平台将保留依法追究相关责任者一切法律责任的权利。</p><p style="line-height: 2;"><span style="">6. 如您违反法律法规或本条款、补充条款，我们将作出独立判断立即暂停或终止您的服务帐号。您需自行对其全部行为承担法律责任，我们不承担任何法律责任。相关国家机关或机构、我们、第三方可能会对您提起诉讼、罚款或采取其他制裁措施，您应独立承担相关责任，造成损害的，您应依法予以赔偿。如因此导致我们遭受损失的，您也应当一并赔偿。</span></p><h3><span style="">五、实名认证</span></h3><p>根据《中华人民共和国网络安全法》规定，网络运营者在为用户提供需要使用信息发布、即时通讯等服务时，应当要求用户提供真实身份信息。</p><h3><span style="">六、隐私政策</span></h3><ol style="text-align: start;"><li style="line-height: 2;">保护您的个人隐私是我们的一项基本原则。</li><li style="line-height: 2;">您在注册帐号或使用本服务的过程中，可能需要填写一些必要的信息。请保持这些信息的及时更新，以便我们向您提供帮助，或更好地为您提供服务。若国家法律法规有特殊规定的，您需要填写真实的身份信息。若您填写的信息不完整，则无法使用本服务或在使用过程中受到限制。</li><li style="line-height: 2;">一般情况下，您可随时浏览、修改自己提交的信息，但出于安全性和身份识别（如号码申诉服务）的考虑，您可能无法修改注册时提供的初始注册信息及其他验证信息。</li><li style="line-height: 2;">我们将运用各种安全技术和程序建立完善的管理制度来保护您的个人信息和数据安全，以免遭受未经授权的访问、使用或披露。</li><li style="line-height: 2;"><span style="">除以下情形外，我们不会将您的个人信息、数据转移或披露给任何非关联的第三方：</span></li></ol><h3><span style="">七、数据安全</span></h3><ol style="text-align: start;"><li style="line-height: 2;">保护您的数据安全是我们的一项基本原则。</li><li style="line-height: 2;"><span style="">我们将尽力保护您使用本平台产品服务产生的数据，并为此采取合理的数据传输、存储、转换等预防保护措施。但是，互联网数据传输、存储、转换均可能存在一定未知且不确定的数据安全风险，该等风险将导致包括但不限于数据丢失、泄露、损坏、无法读取或提取等后果。您确认，您已明确知晓并同意接受该等因互联网引发的风险和后果，并已采取恰当的措施，以便在该等风险发生时将损失降至最低。</span></li><li style="line-height: 2;"><span style="">因互联网技术本身等非我们主观故意或重大过失导致危害您数据安全的，我们不承担任何赔偿责任。因我们重大过失危害您数据安全的，我们的赔偿责任以向您收取的服务费用为上限。</span></li></ol><h3><span style="">八、收费服务</span></h3><ol style="text-align: start;"><li style="line-height: 2;">如您使用本平台的收费服务项目，请遵守相关的条款并按期足额支付费用。</li><li style="line-height: 2;"><span style="">我们可能根据实际需要对收费服务的收费标准、方式进行修改和变更，我们也可能会对部分免费服务开始收费。前述修改、变更或开始收费前，我们将在相应服务页面进行通知或公告。如您不同意上述修改、变更或付费内容，则应停止使用该服务。</span></li></ol><h3><span style="">九、不可抗力与其他免责事由</span></h3><ol style="text-align: start;"><li style="line-height: 2;"><span style="">由于不可抗力事件导致用户遭受损失的，我们不承担责任。不可抗力事件包括但不限于：</span></li><li style="line-height: 2;"><span style="">您理解并同意，在使用本服务的过程中，可能会遇到网络信息或其他用户行为带来的风险，我们不对任何信息的真实性、适用性、合法性承担责任，也不对因侵权行为给您造成的损害负责。这些风险包括但不限于：</span></li><li style="line-height: 2;"><span style="">平台服务中可能会包含指向第三方网站所控制的其他事件或活动链接。我们不对任何此类第三方网站提供的信息、产品、资源、服务表示认可或承担任何责任。如果您通过服务访问、使用第三方网站提供服务或内容而引起的任何责任，由您自行承担后果，我们不承担任何责任。</span></li><li style="line-height: 2;"><span style="">您理解并同意，我们对于与本条款有关或由本条款引起的任何间接的、惩罚性的、特殊的、派生的损失（包括但不限于业务损失、收益损失、利润损失、商誉或其他经济利益的损失），不论是如何产生的，也不论是由对本条款的违约还是由侵权造成的，均不承担责任，即使您已被告知该等损失的可能性。</span></li></ol><h3><span style="">十、服务的变更、中断、终止</span></h3><ol style="text-align: start;"><li style="line-height: 2;">为了改善用户体验、完善服务内容，保证本平台产品服务的安全性和功能的一致性，我们可能随时对本平台产品服务或相关功能、相关应用软件进行更新、功能强化、升级、修改或转移。</li><li style="line-height: 2;">如因自然灾害, 其他信息服务商故障，相关信息设备和软件检修、维护、故障或者任何不可阻挡因素导致服务中断或终止，不视为我们违约，但我们应尽可能减少该因素对用户的影响。</li><li style="line-height: 2;">如发生下列任何一种情形，我们有权中断或终止向您提供的服务：</li><li style="line-height: 2;">如您的服务因包括但不限于上述原因被终止，我们可以从服务器上永久地删除您的数据，但法律法规另有规定的除外。服务终止后，我们没有义务向您返还数据。</li></ol><h3><span style="">十一、法律适用、管辖与其他</span></h3><ol style="text-align: start;"><li style="line-height: 2;">本条款之订立、生效、解释、修订、补充、终止、执行与争议解决均适用中华人民共和国法律；如法律无相关规定的，参照商业惯例及/或行业惯例 。</li><li style="line-height: 2;"><span style="">您因使用本平台产品服务所产生的相关的争议，由我们与您协商解决。协商不成时，任何一方均可向平台经营所在地有管辖权的人民法院提起诉讼。</span></li><li style="line-height: 2;">本条款任一条款被视为废止、无效或不可执行，该条应视为可分的且并不影响本条款其余条款的有效性及可执行性。</li></ol><h3><span style="">十二、联系我们</span></h3><p>如您发现我们的服务中有内容侵犯您的合法权益（包括但不限于肖像权、著作权、内容版权、相关产品知识产权等），您可以发送邮件至 kaivanwong@outlook.com 将下列信息提供给我们，我们会及时给予您必要反馈和帮助。</p><p>此电子邮件地址作为本服务条款的组成部分可能会不时进行更新。</p>',
  },
};
