{
  "name": "Wings Cloud Admin",
  "subName": "# The middle and background permission management system",
  "description": "The middle and background permission management system based on Vuejs + Element Plus provides a general solution and multi-topic and multi-end adaptation for the international scene",
  "copyright": "Copyright © 2022-PRESENT Kaivan Wong",
  "loading": "The resource is loading. Please wait...",
  "building": "Building...",
  "termsConditions": "<h3>First, copyright information</h3><p>Wings Cloud Admin project is copyrighted by Kaivan Wong and is subject to the MIT Open source protocol.</p><h3>Second, the scope of application</h3><p>You can use it free of charge in any commercial project, but you must not violate national laws, endanger national security and unity, social stability, public order and good customs, social morality and other violations of laws and regulations, policies and public order and good customs or infringe the legitimate rights and interests of a third party.</p><h3>Third, Force majeure and other exemption causes</h3><p>We shall not be liable for any losses suffered by users due to force majeure events.</p><p>You understand and agree that, in the process of using the Service, you may encounter risks brought by network information or other user behaviors. We shall not be liable for the authenticity, applicability and legality of any information, nor shall we be liable for the damage caused to you due to the infringement. The Platform services may contain links to other events or activities controlled by third party websites.</p><p>We do not endorse or assume any responsibility for the information, products, resources or services provided by any such third party website. If you access or use the third party website to provide services or content through the service, you will be responsible for any consequences, we do not assume any responsibility.</p><h3 style='text-align: start;'>Fourth. Change, interruption and termination of the service</h3><p style='text-align: start;'>We may update, strengthen, upgrade, modify or transfer the products and services of the Platform or relevant functions and application software at any time in order to improve user experience, perfect service content and ensure the security and functional consistency of the Platform products and services.</p><h3 style='text-align: start;'>Fifth, contact us</h3><p style='text-align: start;'>If you find that any content in our service infringes your legal rights and interests (including but not limited to the right of portrait, copyright, content copyright, intellectual property rights of related products, etc.), you can send an email to <a href='mailto:kaivanwong{'@'}outlook.com'>kaivanwong{'@'}outlook.com</a> and provide us with the following information. We will give you necessary feedback and help in time. This email address may be updated from time to time as an integral part of these Terms of Service.</p>",
  "toolbar": {
    "avatar": {
      "switchRoles": "Switch Roles",
      "signout": "Sign out"
    },
    "notifications": {
      "notifications": "Notifications",
      "readAll": "All Read",
      "empty": "No notifications"
    }
  },
  "tab": {
    "more": "More",
    "close": "Close the current",
    "closeOther": "Close the other",
    "closeAll": "Close all"
  },
  "unkown": {
    "error": "Unknown error, error message: {message}",
    "code": "Unknown error occurs, error code: {code}"
  },
  "request": {
    "wrong": "Wrong request",
    "timeout": "The request timeout",
    "resource": "Error request, the resource was not found",
    "method": "Request method not allowed",
    "http": "The HTTP version does not support this request"
  },
  "network": {
    "implemented": "Network not implemented",
    "error": "Network error",
    "timeout": "Network timeout",
    "connectError": "Network connection error, error code: {code}"
  },
  "server": {
    "error": "Server side error",
    "down": "Service unavailable",
    "notConnect": "Unable to connect to the server"
  },
  "api": {
    "error": "Api error",
    "noParams": "Api interface missing parameters"
  },
  "authentication": {
    "error": "Account error",
    "loginSuccess": "Login successfully",
    "logoutSuccess": "Log Out Successfully",
    "not": "Not authorized, please log in again",
    "denied": "Access denied",
    "longer": "You haven't logged in for a long time, please log in again",
    "overtime": "The login fails, you need to log in again",
    "bind": "You have not logged in for a long time, please log in to the account again",
    "signup": "The user is not registered",
    "signupDescription": "The user is not registered",
    "inconformity": "The third party platform user cannot be obtained",
    "noEmployee": "The account is not associated with any employee",
    "failure": "The account is invalid",
    "notFound": "Account not found",
    "password": "Incorrect password, please try again"
  }
}
